# CS 질문
## 질문 리스트
1. 폭포수(Waterfall) 방법론과 애자일(Agile) 방법론의 차이점을 설명해주세요.
2. 해쉬 함수(Hash Function)에 대해 설명해주세요.
3. 멀티 프로세스와 멀티 스레드에 대해 언제 사용하는지를 포함해 설명해주세요.
4. 세션과 쿠키에 대해 차이점을 포함해 설명해주세요.
5. 데이터베이스의 정규화와 비정규화에 대해 설명해주세요.

### 1.  
  - 폭포수(waterfall)
  폭포수 방법론은 전통적인 개발 방법론으로 개발과정이 선형적이며 순차적입니다 각 단계는 이전 단계의 완료 후에 시작
  요구사항 분석, 설계, 개발, 테스트 및 유지보수의 단계로 구성
  - 애자일(Agile)
  작은 단위의 작업을 반복하여 제품개발 변경에 유연하게 대응할 수 있고 고객의 피드백을 적극적으로 수용가능
  => 폭포수 방법론은 요구사항이 명확하고 변화가 적은 프로젝트에 적합하며, 애자일 방법론은 요구사항이 불확실하고 변화가 많은 프로젝트에 적합합니다.

### 2. 해쉬 함수(Hash Function)에 대해 설명해주세요.
  - 임의의 길이를 갖는 데이터를 고정된 길이의 데이터로 변환시켜주는 함수입니다. 
  - 블록체인에서는 해시 함수가 하는 역할은 ‘암호화'로, 해시값 비교를 통해서 위변조 여부를 판별하고, 무결성을 검증하는 데 사용됩니다. 
  - 비트코인의 블록체인에 사용된 해시 함수는 SHA-256(Secure Hash Algorithm-256)입니다.



### PJT 답변 준비 유의사항
  - html css JS의 상세한 이해 및 브라우저 랜더링 관련 지식
  - 자신이 주로 사용하는 프레임워크에 대한 지식
  - 백엔드, 웹디자인 등 ㅇ협력에 필요한 담당자와의 갈등해결 경험
   -  SW 플래폼 서비스 제품 등 관련 시장조사 분석 경험과 고객의 니즈를 고려한 서비스 기획 경험
   -  전체 개발 과정 프로세스에 대한 이해와 협업경험 및 방법롬
   -  데이터와 리서치를 기반으로 서비스 문제점 개선 경험
   -  유관 부서 및 외부 업체등 다양한 조직과 협업 능력
   -  이슈제기 기능 개선 적용제안 등 능동적 의견 제시 및 적극적 소통경험
   -  IT 트렌드 및 기술 이해도 지식 보유
